JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_edma.h
/*! @brief eDMA channel priority configuration */
typedef struct _edma_channel_Preemption_config
{
    bool enableChannelPreemption; /*!< If true: a channel can be suspended by other channel with higher priority */
    bool enablePreemptAbility;    /*!< If true: a channel can suspend other channel with low priority */
    uint8_t channelPriority;      /*!< Channel priority */
} edma_channel_Preemption_config_t;

/*! @brief eDMA minor offset configuration */
typedef struct _edma_minor_offset_config
{
    bool enableSrcMinorOffset;  /*!< Enable(true) or Disable(false) source minor loop offset. */
    bool enableDestMinorOffset; /*!< Enable(true) or Disable(false) destination minor loop offset. */
    uint32_t minorOffset;       /*!< Offset for a minor loop mapping. */
} edma_minor_offset_config_t;

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMRORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMRORY_ATTRIBUTE
/*! @brief eDMA channel memory attribute */
typedef enum edma_channel_memory_attribute
{
    kEDMA_ChannelNoWriteNoReadNoCacheNoBuffer =
        0x0U, /*!< No write allocate, no read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteNoReadNoCacheBufferable,   /*!< No write allocate, no read allocate, non-cacheable, bufferable.
                                                    */
    kEDMA_ChannelNoWriteNoReadCacheableNoBuffer,   /*!< No write allocate, no read allocate, cacheable, non-bufferable.
                                                    */
    kEDMA_ChannelNoWriteNoReadCacheableBufferable, /*!< No write allocate, no read allocate, cacheable, bufferable. */
    kEDMA_ChannelNoWriteReadNoCacheNoBuffer,   /*!< No write allocate, read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteReadNoCacheBufferable, /*!< No write allocate, read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelNoWriteReadCacheableNoBuffer, /*!< No write allocate, read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteReadCacheableBufferable, /*!< No write allocate, read allocate, cacheable, bufferable. */
    kEDMA_ChannelWriteNoReadNoCacheNoBuffer,   /*!< write allocate, no read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelWriteNoReadNoCacheBufferable, /*!< write allocate, no read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelWriteNoReadCacheableNoBuffer, /*!< write allocate, no read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelWriteNoReadCacheableBufferable, /*!< write allocate, no read allocate, cacheable, bufferable. */
    kEDMA_ChannelWriteReadNoCacheNoBuffer,       /*!< write allocate, read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelWriteReadNoCacheBufferable,     /*!< write allocate, read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelWriteReadCacheableNoBuffer,     /*!< write allocate, read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelWriteReadCacheableBufferable,   /*!< write allocate, read allocate, cacheable, bufferable. */
} edma_channel_memory_attribute_t;
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE && FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE
/*! @brief eDMA4 channel swap size */
typedef enum _edma_channel_swap_size
{
    kEDMA_ChannelSwapDisabled       = 0x0U,  /*!< Swap is disabled. */
    kEDMA_ChannelReadWith8bitSwap   = 0x1U,  /*!< Swap occurs with respect to the read 8bit. */
    kEDMA_ChannelReadWith16bitSwap  = 0x2U,  /*!< Swap occurs with respect to the read 16bit. */
    kEDMA_ChannelReadWith32bitSwap  = 0x3U,  /*!< Swap occurs with respect to the read 32bit. */
    kEDMA_ChannelWriteWith8bitSwap  = 0x9U,  /*!< Swap occurs with respect to the write 8bit. */
    kEDMA_ChannelWriteWith16bitSwap = 0x10U, /*!< Swap occurs with respect to the write 16bit. */
    kEDMA_ChannelWriteWith32bitSwap = 0x11U, /*!< Swap occurs with respect to the write 32bit. */
} edma_channel_swap_size_t;
#endif

/*! @brief eDMA channel system bus information, _edma_channel_sys_bus_info*/
enum
{
#if !(defined(FSL_FEATURE_EDMA_HAS_NO_CH_SBR_ATTR) && FSL_FEATURE_EDMA_HAS_NO_CH_SBR_ATTR)
    kEDMA_AttributeOutput = DMA_CH_SBR_ATTR_MASK, /*!< DMA's AHB system bus attribute output value. */
#endif

    kEDMA_PrivilegedAccessLevel = DMA_CH_SBR_PAL_MASK, /*!< Privileged Access Level for DMA transfers. 0b - User
                                                          protection level; 1b - Privileged protection level. */
    kEDMA_MasterId =
        DMA_CH_SBR_MID_MASK, /*!< DMA's master ID when channel is active and master ID replication is enabled. */
};

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE && FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE
/*! @brief eDMA4 channel access type */
typedef enum _edma_channel_access_type
{
    kEDMA_ChannelDataAccess        = 0x0U, /*!< Data access for eDMA4 transfers. */
    kEDMA_ChannelInstructionAccess = 0x1U, /*!< Instruction access for eDMA4 transfers. */
} edma_channel_access_type_t;
#endif

typedef enum _edma_channel_protection_level
{
    kEDMA_ChannelProtectionLevelUser       = 0x0U, /*!< user protection level for eDMA transfers. */
    kEDMA_ChannelProtectionLevelPrivileged = 0x1U, /*!< Privileged protection level eDMA transfers. */
} edma_channel_protection_level_t;

typedef enum _edma_channel_security_level
{
    kEDMA_ChannelSecurityLevelNonSecure = 0x0U, /*!< non secure  level for eDMA transfers. */
    kEDMA_ChannelSecurityLevelSecure    = 0x1U, /*!< secure level for eDMA transfers. */
} edma_channel_security_level_t;

/*! @brief eDMA4 channel configuration*/
typedef struct _edma_channel_config
{
    edma_channel_Preemption_config_t channelPreemptionConfig; /*!< channel preemption configuration */

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMRORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMRORY_ATTRIBUTE
    edma_channel_memory_attribute_t channelReadMemoryAttribute;  /*!< channel memory read attribute configuration */
    edma_channel_memory_attribute_t channelWriteMemoryAttribute; /*!< channel memory write attribute configuration */
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE && FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE
    edma_channel_swap_size_t channelSwapSize; /*!< channel swap size configuration */
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE && FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE
    edma_channel_access_type_t channelAccessType; /*!< channel access type configuration */
#endif

    uint8_t channelDataSignExtensionBitPosition; /*!< channel data sign extension bit psition configuration */

    dma_request_source_t channelRequestSource; /*!< hardware service request source for the channel */

    bool enableMasterIDReplication;                  /*!< enable master ID replication */
    edma_channel_security_level_t securityLevel;     /*!< security level */
    edma_channel_protection_level_t protectionLevel; /*!< protection level */

} edma_channel_config_t;
#endif

/*!
 * @brief eDMA TCD.
 *
 * This structure is same as TCD register which is described in reference manual,
 * and is used to configure the scatter/gather feature as a next hardware TCD.
 */
typedef edma_core_tcd_t edma_tcd_t;

/*! @brief edma4 channel transfer configuration
 *
 * The transfer configuration structure support full feature configuration of the transfer control descriptor.
 *
 * @note User should pay attention to the transfer size alignment limitation
 *       1. the bytesEachRequest should align with the  srcWidthOfEachTransfer and the dstWidthOfEachTransfer
 *          that is to say bytesEachRequest % srcWidthOfEachTransfer should be 0
 *       2. the srcOffsetOfEachTransfer and dstOffsetOfEachTransfer must be aligne with transfer width
 *       3. the totalBytes should align with the bytesEachRequest
 *       4. the srcAddr should align with the srcWidthOfEachTransfer
 *       5. the dstAddr should align with the dstWidthOfEachTransfer
 *       6. the srcAddr should align with srcAddrModulo if modulo feature is enabled
 *       7. the dstAddr should align with dstAddrModulo if modulo feature is enabled
 *       If anyone of above condition can not be satisfied, the edma4 interfaces will generate assert error.
 *
 * 1.To perform a simple transfer, below members should be initialized at least
 * .srcAddr - source address
 * .dstAddr - destination address
 * .srcWidthOfEachTransfer - data width of source address
 * .dstWidthOfEachTransfer - data width of destination address, normally it should be as same as
 * srcWidthOfEachTransfer .bytesEachRequest - bytes to be transferred in each DMA request .totalBytes - total
 * bytes to be transferred .srcOffsetOfEachTransfer - offset value in bytes unit to be applied to source address as
 * each source read is completed .dstOffsetOfEachTransfer - offset value in bytes unit to be applied to destination
 * address as each destination write is completed enablchannelRequest - channel request can be enabled together with
 * transfer configure submission
 *
 * 2.The transfer configuration structure also support advance feature:
 * Programmable source/destination address range(MODULO)
 * Programmable minor loop offset
 * Programmable major loop offset
 * Programmable channel chain feature
 * Programmable channel transfer control descriptor link feature
 *
 */
typedef struct _edma_transfer_config
{
    uint32_t srcAddr;                      /*!< Source data address. */
    uint32_t destAddr;                     /*!< Destination data address. */
    edma_transfer_size_t srcTransferSize;  /*!< Source data transfer size. */
    edma_transfer_size_t destTransferSize; /*!< Destination data transfer size. */
    int16_t srcOffset;                     /*!< Sign-extended offset value in byte unit applied to the current source
                                                address to form the next-state   value as each source read is completed */
    int16_t destOffset;       /*!< Sign-extended offset value in byte unit applied to the current destination
                  address to form the next-state value as each destination write is completed. */
    uint32_t minorLoopBytes;  /*!< bytes in each minor loop or each request
                               * range: 1 - (2^30 -1) when minor loop mapping is enabled
                               * range: 1 - (2^10 - 1) when minor loop mapping is enabled and source or dest minor
                               * loop offset is enabled
                               * range: 1 - (2^32 - 1) when minor loop mapping is disabled
                               */
    uint32_t majorLoopCounts; /*!< minor loop counts in each major loop, should be 1 at least for each
                               * transfer range: (0 - (2^15 - 1)) when minor loop channel link is
                               * disabled range: (0 - (2^9 - 1)) when minor loop channel link is enabled
                               * total bytes in a transfer = minorLoopCountsEachMajorLoop *
                               * bytesEachMinorLoop
                               */

    uint16_t enabledInterruptMask; /*!< channel interrupt to enable, can be OR'ed value of @ref
                                         _edma_channel_interrupt_enable */

    edma_modulo_t srcAddrModulo; /*!< source circular data queue range */
    int32_t srcMajorLoopOffset;  /*!< source major loop offset */

    edma_modulo_t dstAddrModulo; /*!< destination circular data queue range */
    int32_t dstMajorLoopOffset;  /*!< destination major loop offset */

    bool enableSrcMinorLoopOffset; /*!< enable source minor loop offset */
    bool enableDstMinorLoopOffset; /*!< enable dest minor loop offset */
    int32_t minorLoopOffset;       /*!< burst offset, the offset will be applied after minor loop update */

    bool enableChannelMajorLoopLink; /*!< channel link when major loop complete */
    uint32_t majorLoopLinkChannel;   /*!< major loop link channel number */

    bool enableChannelMinorLoopLink; /*!< channel link when minor loop complete */
    uint32_t minorLoopLinkChannel;   /*!< minor loop link channel number */

    bool enableChannelRequest; /*!< enable the channel request signal */

    edma_tcd_t *linkTCD; /*!< pointer to the link transfer control descriptor */
} edma_transfer_config_t;

/*! @brief eDMA global configuration structure.*/
typedef struct _edma_config
{
#if defined FSL_FEATURE_EDMA_HAS_CONTINUOUS_LINK_MODE && FSL_FEATURE_EDMA_HAS_CONTINUOUS_LINK_MODE
    bool enableContinuousLinkMode; /*!< Enable (true) continuous link mode. Upon minor loop completion, the channel
                                        activates again if that channel has a minor loop channel link enabled and
                                        the link channel is itself. */
#endif

#if defined FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION && FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION
    bool enableMasterIdReplication; /*!< Enable (true) master ID replication. If Master ID replication is disabled, the
                                        privileged protection level (supervisor mode) for eDMA4 transfers is used. */
#endif

    bool enableGlobalChannelLink; /*!< Enable(true) channel linking is available and controlled by each channel's link
                                     settings. */

    bool enableHaltOnError; /*!< Enable (true) transfer halt on error. Any error causes the HALT bit to set.
                          Subsequently, all service requests are ignored until the HALT bit is cleared.*/

    bool enableDebugMode; /*!< Enable(true) eDMA4 debug mode. When in debug mode, the eDMA4 stalls the start of
                               a new channel. Executing channels are allowed to complete. */

